veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxEray_bf.h
/** \brief Offset for Ifx_ERAY_ACS_Bits.CIA */
#define IFX_ERAY_ACS_CIA_OFF (3u)

/** \brief Length for Ifx_ERAY_ACS_Bits.SBVA */
#define IFX_ERAY_ACS_SBVA_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACS_Bits.SBVA */
#define IFX_ERAY_ACS_SBVA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACS_Bits.SBVA */
#define IFX_ERAY_ACS_SBVA_OFF (4u)

/** \brief Length for Ifx_ERAY_ACS_Bits.VFRB */
#define IFX_ERAY_ACS_VFRB_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACS_Bits.VFRB */
#define IFX_ERAY_ACS_VFRB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACS_Bits.VFRB */
#define IFX_ERAY_ACS_VFRB_OFF (8u)

/** \brief Length for Ifx_ERAY_ACS_Bits.SEDB */
#define IFX_ERAY_ACS_SEDB_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACS_Bits.SEDB */
#define IFX_ERAY_ACS_SEDB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACS_Bits.SEDB */
#define IFX_ERAY_ACS_SEDB_OFF (9u)

/** \brief Length for Ifx_ERAY_ACS_Bits.CEDB */
#define IFX_ERAY_ACS_CEDB_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACS_Bits.CEDB */
#define IFX_ERAY_ACS_CEDB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACS_Bits.CEDB */
#define IFX_ERAY_ACS_CEDB_OFF (10u)

/** \brief Length for Ifx_ERAY_ACS_Bits.CIB */
#define IFX_ERAY_ACS_CIB_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACS_Bits.CIB */
#define IFX_ERAY_ACS_CIB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACS_Bits.CIB */
#define IFX_ERAY_ACS_CIB_OFF (11u)

/** \brief Length for Ifx_ERAY_ACS_Bits.SBVB */
#define IFX_ERAY_ACS_SBVB_LEN (1u)

/** \brief Mask for Ifx_ERAY_ACS_Bits.SBVB */
#define IFX_ERAY_ACS_SBVB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ACS_Bits.SBVB */
#define IFX_ERAY_ACS_SBVB_OFF (12u)

/** \brief Length for Ifx_ERAY_ESID_Bits.EID */
#define IFX_ERAY_ESID_EID_LEN (10u)

/** \brief Mask for Ifx_ERAY_ESID_Bits.EID */
#define IFX_ERAY_ESID_EID_MSK (0x3ffu)

/** \brief Offset for Ifx_ERAY_ESID_Bits.EID */
#define IFX_ERAY_ESID_EID_OFF (0u)

/** \brief Length for Ifx_ERAY_ESID_Bits.RXEA */
#define IFX_ERAY_ESID_RXEA_LEN (1u)

/** \brief Mask for Ifx_ERAY_ESID_Bits.RXEA */
#define IFX_ERAY_ESID_RXEA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ESID_Bits.RXEA */
#define IFX_ERAY_ESID_RXEA_OFF (14u)

/** \brief Length for Ifx_ERAY_ESID_Bits.RXEB */
#define IFX_ERAY_ESID_RXEB_LEN (1u)

/** \brief Mask for Ifx_ERAY_ESID_Bits.RXEB */
#define IFX_ERAY_ESID_RXEB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_ESID_Bits.RXEB */
#define IFX_ERAY_ESID_RXEB_OFF (15u)

/** \brief Length for Ifx_ERAY_OSID_Bits.OID */
#define IFX_ERAY_OSID_OID_LEN (10u)

/** \brief Mask for Ifx_ERAY_OSID_Bits.OID */
#define IFX_ERAY_OSID_OID_MSK (0x3ffu)

/** \brief Offset for Ifx_ERAY_OSID_Bits.OID */
#define IFX_ERAY_OSID_OID_OFF (0u)

/** \brief Length for Ifx_ERAY_OSID_Bits.RXOA */
#define IFX_ERAY_OSID_RXOA_LEN (1u)

/** \brief Mask for Ifx_ERAY_OSID_Bits.RXOA */
#define IFX_ERAY_OSID_RXOA_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_OSID_Bits.RXOA */
#define IFX_ERAY_OSID_RXOA_OFF (14u)

/** \brief Length for Ifx_ERAY_OSID_Bits.RXOB */
#define IFX_ERAY_OSID_RXOB_LEN (1u)

/** \brief Mask for Ifx_ERAY_OSID_Bits.RXOB */
#define IFX_ERAY_OSID_RXOB_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_OSID_Bits.RXOB */
#define IFX_ERAY_OSID_RXOB_OFF (15u)

/** \brief Length for Ifx_ERAY_NMV_Bits.NM */
#define IFX_ERAY_NMV_NM_LEN (32u)

/** \brief Mask for Ifx_ERAY_NMV_Bits.NM */
#define IFX_ERAY_NMV_NM_MSK (0xffffffffu)

/** \brief Offset for Ifx_ERAY_NMV_Bits.NM */
#define IFX_ERAY_NMV_NM_OFF (0u)

/** \brief Length for Ifx_ERAY_MRC_Bits.FDB */
#define IFX_ERAY_MRC_FDB_LEN (8u)

/** \brief Mask for Ifx_ERAY_MRC_Bits.FDB */
#define IFX_ERAY_MRC_FDB_MSK (0xffu)

/** \brief Offset for Ifx_ERAY_MRC_Bits.FDB */
#define IFX_ERAY_MRC_FDB_OFF (0u)

/** \brief Length for Ifx_ERAY_MRC_Bits.FFB */
#define IFX_ERAY_MRC_FFB_LEN (8u)

/** \brief Mask for Ifx_ERAY_MRC_Bits.FFB */
#define IFX_ERAY_MRC_FFB_MSK (0xffu)

/** \brief Offset for Ifx_ERAY_MRC_Bits.FFB */
#define IFX_ERAY_MRC_FFB_OFF (8u)

/** \brief Length for Ifx_ERAY_MRC_Bits.LCB */
#define IFX_ERAY_MRC_LCB_LEN (8u)

/** \brief Mask for Ifx_ERAY_MRC_Bits.LCB */
#define IFX_ERAY_MRC_LCB_MSK (0xffu)

/** \brief Offset for Ifx_ERAY_MRC_Bits.LCB */
#define IFX_ERAY_MRC_LCB_OFF (16u)

/** \brief Length for Ifx_ERAY_MRC_Bits.SEC */
#define IFX_ERAY_MRC_SEC_LEN (2u)

/** \brief Mask for Ifx_ERAY_MRC_Bits.SEC */
#define IFX_ERAY_MRC_SEC_MSK (0x3u)

/** \brief Offset for Ifx_ERAY_MRC_Bits.SEC */
#define IFX_ERAY_MRC_SEC_OFF (24u)

/** \brief Length for Ifx_ERAY_MRC_Bits.SPLM */
#define IFX_ERAY_MRC_SPLM_LEN (1u)

/** \brief Mask for Ifx_ERAY_MRC_Bits.SPLM */
#define IFX_ERAY_MRC_SPLM_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MRC_Bits.SPLM */
#define IFX_ERAY_MRC_SPLM_OFF (26u)

/** \brief Length for Ifx_ERAY_FRF_Bits.CH */
#define IFX_ERAY_FRF_CH_LEN (2u)

/** \brief Mask for Ifx_ERAY_FRF_Bits.CH */
#define IFX_ERAY_FRF_CH_MSK (0x3u)

/** \brief Offset for Ifx_ERAY_FRF_Bits.CH */
#define IFX_ERAY_FRF_CH_OFF (0u)

/** \brief Length for Ifx_ERAY_FRF_Bits.FID */
#define IFX_ERAY_FRF_FID_LEN (11u)

/** \brief Mask for Ifx_ERAY_FRF_Bits.FID */
#define IFX_ERAY_FRF_FID_MSK (0x7ffu)

/** \brief Offset for Ifx_ERAY_FRF_Bits.FID */
#define IFX_ERAY_FRF_FID_OFF (2u)

/** \brief Length for Ifx_ERAY_FRF_Bits.CYF */
#define IFX_ERAY_FRF_CYF_LEN (7u)

/** \brief Mask for Ifx_ERAY_FRF_Bits.CYF */
#define IFX_ERAY_FRF_CYF_MSK (0x7fu)

/** \brief Offset for Ifx_ERAY_FRF_Bits.CYF */
#define IFX_ERAY_FRF_CYF_OFF (16u)

/** \brief Length for Ifx_ERAY_FRF_Bits.RSS */
#define IFX_ERAY_FRF_RSS_LEN (1u)

/** \brief Mask for Ifx_ERAY_FRF_Bits.RSS */
#define IFX_ERAY_FRF_RSS_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_FRF_Bits.RSS */
#define IFX_ERAY_FRF_RSS_OFF (23u)

/** \brief Length for Ifx_ERAY_FRF_Bits.RNF */
#define IFX_ERAY_FRF_RNF_LEN (1u)

/** \brief Mask for Ifx_ERAY_FRF_Bits.RNF */
#define IFX_ERAY_FRF_RNF_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_FRF_Bits.RNF */
#define IFX_ERAY_FRF_RNF_OFF (24u)

/** \brief Length for Ifx_ERAY_FRFM_Bits.MFID */
#define IFX_ERAY_FRFM_MFID_LEN (11u)

/** \brief Mask for Ifx_ERAY_FRFM_Bits.MFID */
#define IFX_ERAY_FRFM_MFID_MSK (0x7ffu)

/** \brief Offset for Ifx_ERAY_FRFM_Bits.MFID */
#define IFX_ERAY_FRFM_MFID_OFF (2u)

/** \brief Length for Ifx_ERAY_FCL_Bits.CL */
#define IFX_ERAY_FCL_CL_LEN (8u)

/** \brief Mask for Ifx_ERAY_FCL_Bits.CL */
#define IFX_ERAY_FCL_CL_MSK (0xffu)

