veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxEray_bf.h
/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND89 */
#define IFX_ERAY_NDAT3_ND89_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND89 */
#define IFX_ERAY_NDAT3_ND89_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND89 */
#define IFX_ERAY_NDAT3_ND89_OFF (25u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND90 */
#define IFX_ERAY_NDAT3_ND90_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND90 */
#define IFX_ERAY_NDAT3_ND90_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND90 */
#define IFX_ERAY_NDAT3_ND90_OFF (26u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND91 */
#define IFX_ERAY_NDAT3_ND91_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND91 */
#define IFX_ERAY_NDAT3_ND91_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND91 */
#define IFX_ERAY_NDAT3_ND91_OFF (27u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND92 */
#define IFX_ERAY_NDAT3_ND92_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND92 */
#define IFX_ERAY_NDAT3_ND92_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND92 */
#define IFX_ERAY_NDAT3_ND92_OFF (28u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND93 */
#define IFX_ERAY_NDAT3_ND93_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND93 */
#define IFX_ERAY_NDAT3_ND93_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND93 */
#define IFX_ERAY_NDAT3_ND93_OFF (29u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND94 */
#define IFX_ERAY_NDAT3_ND94_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND94 */
#define IFX_ERAY_NDAT3_ND94_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND94 */
#define IFX_ERAY_NDAT3_ND94_OFF (30u)

/** \brief Length for Ifx_ERAY_NDAT3_Bits.ND95 */
#define IFX_ERAY_NDAT3_ND95_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT3_Bits.ND95 */
#define IFX_ERAY_NDAT3_ND95_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT3_Bits.ND95 */
#define IFX_ERAY_NDAT3_ND95_OFF (31u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND96 */
#define IFX_ERAY_NDAT4_ND96_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND96 */
#define IFX_ERAY_NDAT4_ND96_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND96 */
#define IFX_ERAY_NDAT4_ND96_OFF (0u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND97 */
#define IFX_ERAY_NDAT4_ND97_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND97 */
#define IFX_ERAY_NDAT4_ND97_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND97 */
#define IFX_ERAY_NDAT4_ND97_OFF (1u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND98 */
#define IFX_ERAY_NDAT4_ND98_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND98 */
#define IFX_ERAY_NDAT4_ND98_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND98 */
#define IFX_ERAY_NDAT4_ND98_OFF (2u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND99 */
#define IFX_ERAY_NDAT4_ND99_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND99 */
#define IFX_ERAY_NDAT4_ND99_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND99 */
#define IFX_ERAY_NDAT4_ND99_OFF (3u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND100 */
#define IFX_ERAY_NDAT4_ND100_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND100 */
#define IFX_ERAY_NDAT4_ND100_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND100 */
#define IFX_ERAY_NDAT4_ND100_OFF (4u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND101 */
#define IFX_ERAY_NDAT4_ND101_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND101 */
#define IFX_ERAY_NDAT4_ND101_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND101 */
#define IFX_ERAY_NDAT4_ND101_OFF (5u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND102 */
#define IFX_ERAY_NDAT4_ND102_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND102 */
#define IFX_ERAY_NDAT4_ND102_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND102 */
#define IFX_ERAY_NDAT4_ND102_OFF (6u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND103 */
#define IFX_ERAY_NDAT4_ND103_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND103 */
#define IFX_ERAY_NDAT4_ND103_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND103 */
#define IFX_ERAY_NDAT4_ND103_OFF (7u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND104 */
#define IFX_ERAY_NDAT4_ND104_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND104 */
#define IFX_ERAY_NDAT4_ND104_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND104 */
#define IFX_ERAY_NDAT4_ND104_OFF (8u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND105 */
#define IFX_ERAY_NDAT4_ND105_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND105 */
#define IFX_ERAY_NDAT4_ND105_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND105 */
#define IFX_ERAY_NDAT4_ND105_OFF (9u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND106 */
#define IFX_ERAY_NDAT4_ND106_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND106 */
#define IFX_ERAY_NDAT4_ND106_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND106 */
#define IFX_ERAY_NDAT4_ND106_OFF (10u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND107 */
#define IFX_ERAY_NDAT4_ND107_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND107 */
#define IFX_ERAY_NDAT4_ND107_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND107 */
#define IFX_ERAY_NDAT4_ND107_OFF (11u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND108 */
#define IFX_ERAY_NDAT4_ND108_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND108 */
#define IFX_ERAY_NDAT4_ND108_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND108 */
#define IFX_ERAY_NDAT4_ND108_OFF (12u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND109 */
#define IFX_ERAY_NDAT4_ND109_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND109 */
#define IFX_ERAY_NDAT4_ND109_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND109 */
#define IFX_ERAY_NDAT4_ND109_OFF (13u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND110 */
#define IFX_ERAY_NDAT4_ND110_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND110 */
#define IFX_ERAY_NDAT4_ND110_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_NDAT4_Bits.ND110 */
#define IFX_ERAY_NDAT4_ND110_OFF (14u)

/** \brief Length for Ifx_ERAY_NDAT4_Bits.ND111 */
#define IFX_ERAY_NDAT4_ND111_LEN (1u)

/** \brief Mask for Ifx_ERAY_NDAT4_Bits.ND111 */
#define IFX_ERAY_NDAT4_ND111_MSK (0x1u)

