veecle/veecle-pxros/app-tc37x/bsp/uc/uc_tc37/TC37xPD_RegCHeaders/_Reg/IfxEray_bf.h
/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP119 */
#define IFX_ERAY_MSIC4_MSIP119_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP119 */
#define IFX_ERAY_MSIC4_MSIP119_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP119 */
#define IFX_ERAY_MSIC4_MSIP119_OFF (23u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP120 */
#define IFX_ERAY_MSIC4_MSIP120_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP120 */
#define IFX_ERAY_MSIC4_MSIP120_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP120 */
#define IFX_ERAY_MSIC4_MSIP120_OFF (24u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP121 */
#define IFX_ERAY_MSIC4_MSIP121_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP121 */
#define IFX_ERAY_MSIC4_MSIP121_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP121 */
#define IFX_ERAY_MSIC4_MSIP121_OFF (25u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP122 */
#define IFX_ERAY_MSIC4_MSIP122_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP122 */
#define IFX_ERAY_MSIC4_MSIP122_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP122 */
#define IFX_ERAY_MSIC4_MSIP122_OFF (26u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP123 */
#define IFX_ERAY_MSIC4_MSIP123_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP123 */
#define IFX_ERAY_MSIC4_MSIP123_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP123 */
#define IFX_ERAY_MSIC4_MSIP123_OFF (27u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP124 */
#define IFX_ERAY_MSIC4_MSIP124_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP124 */
#define IFX_ERAY_MSIC4_MSIP124_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP124 */
#define IFX_ERAY_MSIC4_MSIP124_OFF (28u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP125 */
#define IFX_ERAY_MSIC4_MSIP125_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP125 */
#define IFX_ERAY_MSIC4_MSIP125_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP125 */
#define IFX_ERAY_MSIC4_MSIP125_OFF (29u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP126 */
#define IFX_ERAY_MSIC4_MSIP126_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP126 */
#define IFX_ERAY_MSIC4_MSIP126_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP126 */
#define IFX_ERAY_MSIC4_MSIP126_OFF (30u)

/** \brief Length for Ifx_ERAY_MSIC4_Bits.MSIP127 */
#define IFX_ERAY_MSIC4_MSIP127_LEN (1u)

/** \brief Mask for Ifx_ERAY_MSIC4_Bits.MSIP127 */
#define IFX_ERAY_MSIC4_MSIP127_MSK (0x1u)

/** \brief Offset for Ifx_ERAY_MSIC4_Bits.MSIP127 */
#define IFX_ERAY_MSIC4_MSIP127_OFF (31u)

/** \brief Length for Ifx_ERAY_CREL_Bits.DAY */
#define IFX_ERAY_CREL_DAY_LEN (8u)

/** \brief Mask for Ifx_ERAY_CREL_Bits.DAY */
#define IFX_ERAY_CREL_DAY_MSK (0xffu)

/** \brief Offset for Ifx_ERAY_CREL_Bits.DAY */
#define IFX_ERAY_CREL_DAY_OFF (0u)

/** \brief Length for Ifx_ERAY_CREL_Bits.MON */
#define IFX_ERAY_CREL_MON_LEN (8u)

/** \brief Mask for Ifx_ERAY_CREL_Bits.MON */
#define IFX_ERAY_CREL_MON_MSK (0xffu)

/** \brief Offset for Ifx_ERAY_CREL_Bits.MON */
#define IFX_ERAY_CREL_MON_OFF (8u)

/** \brief Length for Ifx_ERAY_CREL_Bits.YEAR */
#define IFX_ERAY_CREL_YEAR_LEN (4u)

/** \brief Mask for Ifx_ERAY_CREL_Bits.YEAR */
#define IFX_ERAY_CREL_YEAR_MSK (0xfu)

/** \brief Offset for Ifx_ERAY_CREL_Bits.YEAR */
#define IFX_ERAY_CREL_YEAR_OFF (16u)

/** \brief Length for Ifx_ERAY_CREL_Bits.SUBSTEP */
#define IFX_ERAY_CREL_SUBSTEP_LEN (4u)

/** \brief Mask for Ifx_ERAY_CREL_Bits.SUBSTEP */
#define IFX_ERAY_CREL_SUBSTEP_MSK (0xfu)

/** \brief Offset for Ifx_ERAY_CREL_Bits.SUBSTEP */
#define IFX_ERAY_CREL_SUBSTEP_OFF (20u)

/** \brief Length for Ifx_ERAY_CREL_Bits.STEP */
#define IFX_ERAY_CREL_STEP_LEN (4u)

/** \brief Mask for Ifx_ERAY_CREL_Bits.STEP */
#define IFX_ERAY_CREL_STEP_MSK (0xfu)

/** \brief Offset for Ifx_ERAY_CREL_Bits.STEP */
#define IFX_ERAY_CREL_STEP_OFF (24u)

/** \brief Length for Ifx_ERAY_CREL_Bits.REL */
#define IFX_ERAY_CREL_REL_LEN (4u)

/** \brief Mask for Ifx_ERAY_CREL_Bits.REL */
#define IFX_ERAY_CREL_REL_MSK (0xfu)

/** \brief Offset for Ifx_ERAY_CREL_Bits.REL */
#define IFX_ERAY_CREL_REL_OFF (28u)

/** \brief Length for Ifx_ERAY_ENDN_Bits.ETV */
#define IFX_ERAY_ENDN_ETV_LEN (32u)

/** \brief Mask for Ifx_ERAY_ENDN_Bits.ETV */
#define IFX_ERAY_ENDN_ETV_MSK (0xffffffffu)

/** \brief Offset for Ifx_ERAY_ENDN_Bits.ETV */
#define IFX_ERAY_ENDN_ETV_OFF (0u)

/** \brief Length for Ifx_ERAY_WRDS_Bits.MDWB0 */
#define IFX_ERAY_WRDS_MDWB0_LEN (8u)

/** \brief Mask for Ifx_ERAY_WRDS_Bits.MDWB0 */
#define IFX_ERAY_WRDS_MDWB0_MSK (0xffu)

/** \brief Offset for Ifx_ERAY_WRDS_Bits.MDWB0 */
#define IFX_ERAY_WRDS_MDWB0_OFF (0u)

/** \brief Length for Ifx_ERAY_WRDS_Bits.MDWB1 */
#define IFX_ERAY_WRDS_MDWB1_LEN (8u)

/** \brief Mask for Ifx_ERAY_WRDS_Bits.MDWB1 */
#define IFX_ERAY_WRDS_MDWB1_MSK (0xffu)

/** \brief Offset for Ifx_ERAY_WRDS_Bits.MDWB1 */
#define IFX_ERAY_WRDS_MDWB1_OFF (8u)

/** \brief Length for Ifx_ERAY_WRDS_Bits.MDWB2 */
#define IFX_ERAY_WRDS_MDWB2_LEN (8u)

/** \brief Mask for Ifx_ERAY_WRDS_Bits.MDWB2 */
#define IFX_ERAY_WRDS_MDWB2_MSK (0xffu)

/** \brief Offset for Ifx_ERAY_WRDS_Bits.MDWB2 */
#define IFX_ERAY_WRDS_MDWB2_OFF (16u)

/** \brief Length for Ifx_ERAY_WRDS_Bits.MDWB3 */
#define IFX_ERAY_WRDS_MDWB3_LEN (8u)

/** \brief Mask for Ifx_ERAY_WRDS_Bits.MDWB3 */
#define IFX_ERAY_WRDS_MDWB3_MSK (0xffu)

/** \brief Offset for Ifx_ERAY_WRDS_Bits.MDWB3 */
#define IFX_ERAY_WRDS_MDWB3_OFF (24u)

/** \brief Length for Ifx_ERAY_WRHS1_Bits.FID */
#define IFX_ERAY_WRHS1_FID_LEN (11u)

/** \brief Mask for Ifx_ERAY_WRHS1_Bits.FID */
#define IFX_ERAY_WRHS1_FID_MSK (0x7ffu)

/** \brief Offset for Ifx_ERAY_WRHS1_Bits.FID */
#define IFX_ERAY_WRHS1_FID_OFF (0u)

/** \brief Length for Ifx_ERAY_WRHS1_Bits.CYC */
#define IFX_ERAY_WRHS1_CYC_LEN (7u)

/** \brief Mask for Ifx_ERAY_WRHS1_Bits.CYC */
#define IFX_ERAY_WRHS1_CYC_MSK (0x7fu)

/** \brief Offset for Ifx_ERAY_WRHS1_Bits.CYC */
#define IFX_ERAY_WRHS1_CYC_OFF (16u)

/** \brief Length for Ifx_ERAY_WRHS1_Bits.CHA */
#define IFX_ERAY_WRHS1_CHA_LEN (1u)

/** \brief Mask for Ifx_ERAY_WRHS1_Bits.CHA */
#define IFX_ERAY_WRHS1_CHA_MSK (0x1u)

